#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("парКонвертация") Тогда
		Объект.Конвертация = Параметры.парКонвертация;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указана конвертация'"));
		Возврат;
	КонецЕсли;
	ТХ = ВыгрузитьМодулиСервер();
	КонвертацияДанныхXDTOКлиент.ВывестиТекстДляИспользования(ТХ);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьМодулиСервер()
	ВерсияФорматаМенеджера = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Конвертация, "ВерсияФорматаМенеджера"));
	Если ВерсияФорматаМенеджера = "1" Тогда
		ОбработкаОбъект = Обработки.ВыгрузкаМодуляВерсии1.Создать();
		ОбработкаОбъект.Конвертация = Объект.Конвертация;
	Иначе
		ОбработкаОбъект = Обработки.ВыгрузкаМодуля.Создать();
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;

	Возврат ОбработкаОбъект.ВыполнитьВыгрузкуМодулей();
КонецФункции
#КонецОбласти
