#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ОбрабатыватьАлгоритмы = Истина;
	Объект.ОбрабатыватьПКО = Истина;
	Объект.ОбрабатыватьПКПД = Истина;
	Объект.ОбрабатыватьПОД = Истина;
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоставДанныхПриИзменении(Элемент)
	Если СоставДанных = 0 Тогда
		// Все
		Объект.ОбрабатыватьАлгоритмы = Истина;
		Объект.ОбрабатыватьПКО = Истина;
		Объект.ОбрабатыватьПКПД = Истина;
		Объект.ОбрабатыватьПОД = Истина;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КопироватьСоставКонвертации(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КопироватьСоставКонвертацииНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ГруппаСоставВыборочно.Видимость = (СоставДанных <> 0);
КонецПроцедуры

&НаСервере
Процедура КопироватьСоставКонвертацииНаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.ЗаполнитьСоставКонвертации();
КонецПроцедуры
#КонецОбласти