#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Добавляет в справочник новый элемент с указанными реквизитами.
// Параметры:
//  Конвертация - СправочникСсылка.Конвертация - Конвертация, в которую надо включить элемент.
//  ЭлементКонвертации - Произвольный - ссылка на правило конвертации объекта, алгоритм,
//                                     правило обработки данных и т.д.
//  РежимЗагрузки - Булево - Признак дополнения в режиме загрузки данных.
Процедура ДополнитьСоставКонвертации(Конвертация, ЭлементКонвертации, РежимЗагрузки = Ложь) Экспорт
	СпрОбъект = Справочники.СоставыКонвертаций.СоздатьЭлемент();
	СпрОбъект.Владелец = Конвертация;
	СпрОбъект.ЭлементКонвертации = ЭлементКонвертации;
	СпрОбъект.Наименование = ""+СокрЛП(СпрОбъект.Владелец) + ", " + СокрЛП(СпрОбъект.ЭлементКонвертации);
	Если РежимЗагрузки Тогда
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		СпрОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	КонецЕсли;
	СпрОбъект.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
