#Область ОбработчикиСобытий
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Попытка
		Представление = "Объект: " + Данные.Ссылка.ОбъектФормата
			+ ?(ЗначениеЗаполнено(Данные.Ссылка.СвойствоФормата), "; Свойство: " + Данные.Ссылка.СвойствоФормата, "")
			+ "; " + Данные.Ссылка.Операция 
			+ ?(ЗначениеЗаполнено(Данные.Ссылка.ОписаниеИзменений), ": " + Данные.Ссылка.ОписаниеИзменений, "");
	Исключение
		Представление = "";
	КонецПопытки;
	
КонецПроцедуры
#КонецОбласти