#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ИсточникДанных = ДанныеЗаполнения.Владелец;
	Иначе
		ИсточникДанных = ДанныеЗаполнения;
	КонецЕсли;
	
	Владелец      = ИсточникДанных.Ссылка;
	ОбъектФормата = ИсточникДанных.ОбъектФормата;
	
КонецПроцедуры
#КонецОбласти
#КонецЕсли