#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ЭтаФорма.Параметры.Свойство("ПараметрыДерева") Тогда
		Если ЭтаФорма.Параметры.ПараметрыДерева.Свойство("ОбъектКопирования") Тогда
			ЗаполнитьЗначенияСвойств(Объект,  ЭтаФорма.Параметры.ПараметрыДерева.ОбъектКопирования,"Владелец, Наименование, Комментарий");
		ИначеЕсли ЭтаФорма.Параметры.ПараметрыДерева.Свойство("ОбъектФормата") Тогда
			Объект.Владелец = ЭтаФорма.Параметры.ПараметрыДерева.ОбъектФормата;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти