#Область ОбработчикиСобытий
Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)
	
	Если ТипЗнч(ЭлементДанных) = Тип("КонстантаМенеджерЗначения.НастройкиПодчиненногоУзлаРИБ")
		Или ТипЗнч(ЭлементДанных) = Тип("КонстантаМенеджерЗначения.ГлавныйУзел") Тогда
		
		Если ЭтотОбъект.ДляПубликации Тогда
			ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если РежимВыгрузкиПриНеобходимости <> Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости Тогда
		РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти