#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовФормата(СписокОбъектовФормата, Неопределено, Истина,, Справочники.ВерсииФормата.ПустаяСсылка());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КонвертацияДанныхXDTOКлиент.ЗаполнитьСписокВыбораЭлементаФормы(Элементы.СоставОбъектФормата, СписокОбъектовФормата);
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СоставОбъектФорматаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекОбъектФормата = Элементы.Состав.ТекущиеДанные.СоставОбъектФормата;
	ПараметрыФормыВыбора = Новый Структура("ВерсияФормата, ТекущаяСтрока, РежимРаботы", 
					ПредопределенноеЗначение("Справочник.ВерсииФормата.ПустаяСсылка"), ТекОбъектФормата, "ОбъектФормата");
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства",ПараметрыФормыВыбора,Элемент,,,,
			Новый ОписаниеОповещения("ВыбранОбъектФормата", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВыбранОбъектФормата(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если НЕ ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Элементы.Состав.ТекущиеДанные.СоставОбъектФормата = РезультатЗакрытия;
КонецПроцедуры

#КонецОбласти

