#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСтруктуруКонфигурации(Команда)
	СтруктураПараметров = Новый Структура("парКонфигурация", Объект.Ссылка);
	ОткрытьФорму("Обработка.ЗагрузкаСтруктурыКонфигурации.Форма", СтруктураПараметров);
КонецПроцедуры

#КонецОбласти
