#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИмяОбработчикаПередКонвертацией = "ПередКонвертацией";
	ИмяОбработчикаПослеКонвертации = "ПослеКонвертации";
	ИмяОбработчикаПередОтложеннымЗаполнением = "ПередОтложеннымЗаполнением";
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
КонецПроцедуры
#КонецОбласти
