#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Попытка прочитать конвертацию из буфера обмена.
	Попытка
		КОбъект = Новый COMОбъект("htmlfile");
		ДанныеБуфера = КОбъект.ParentWindow.ClipboardData.Getdata("Text");
	Исключение
		ДанныеБуфера = "";
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		// Вычисление конвертации по первой строке модуля.
		СтрокаПервая = СокрЛП(СтрПолучитьСтроку(ДанныеБуфера, 1));
		Если Лев(СтрокаПервая, 14) = "//Конвертация_" Тогда
			ИмяКонвертации = СтрЗаменить(СтрокаПервая, "//Конвертация_","");
			Объект.Конвертация = Справочники.Конвертации.НайтиПоНаименованию(ИмяКонвертации);
			КонвертацияПриИзмененииСервер();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
			// Будет открыта форма.
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЗагрузитьОбработчикиСервер(ДанныеБуфера);

	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КонвертацияПриИзменении(Элемент)
	КонвертацияПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагрузкаАлгоритмов" Тогда
		Если Параметр.Отказ = Ложь 
			И Параметр.ИдентификаторФормы = ЭтаФорма.УникальныйИдентификатор Тогда
			ЗагрузитьОбработчикиСервер(ДанныеБуфера);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьОбработчики(Команда)
	КОбъект = Новый COMОбъект("htmlfile");
	ДанныеБуфера = КОбъект.ParentWindow.ClipboardData.Getdata("Text");
	// Результат проверки будет в обработке оповещения.
	КонвертацияДанныхXDTOКлиент.ПроверитьКонвертациюПриЗагрузкеАлгоритмов(ДанныеБуфера, Объект.Конвертация, 
								НаименованиеКонвертации, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗагрузитьОбработчикиСервер(ТекстовыйДокумент)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.РазобратьТекстМодуля(ТекстовыйДокумент);
КонецПроцедуры

Процедура КонвертацияПриИзмененииСервер()
	НаименованиеКонвертации = Объект.Конвертация.Наименование;
КонецПроцедуры


#КонецОбласти