#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("парКонвертация") Тогда
		Объект.Конвертация = Параметры.парКонвертация;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указана конвертация'"));
		Возврат;
	КонецЕсли;
	ТХ = ВыгрузитьМодулиСервер();
	КонвертацияДанныхXDTOКлиент.ВывестиТекстДляИспользования(ТХ);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьМодулиСервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ВыполнитьВыгрузкуМодулей();
КонецФункции
#КонецОбласти
