#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		Код = ""+СокрЛП(ОбъектКонфигурации)+"_"+СокрЛП(ОбъектФормата);
	КонецЕсли;
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ИспользоватьДляОтправки 
		И ЗначениеЗаполнено(АлгоритмПриОтправкеДанных) Тогда
		АлгоритмПриОтправкеДанных = "";
	КонецЕсли;
	Если НЕ ИспользоватьДляПолучения И (ЗначениеЗаполнено(АлгоритмПередПолучениемДанных)
		Или ЗначениеЗаполнено(АлгоритмПриПолученииДанных)
		Или ЗначениеЗаполнено(АлгоритмПослеЗагрузкиВсехДанных)) Тогда
		АлгоритмПередПолучениемДанных = "";
		АлгоритмПриПолученииДанных = "";
		АлгоритмПослеЗагрузкиВсехДанных = "";
	КонецЕсли;
	Если ЗначениеЗаполнено(Ссылка)
		И ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		КонвертацияДанныхXDTOВызовСервера.ОбработатьПометкуНаУдалениеЭлементаКонвертации(Ссылка, ПометкаУдаления);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#КонецЕсли